Revit 2027 API
WireSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As WireSetIterator
public:
virtual WireSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> WireSetIterator
override ForwardIterator : unit -> WireSetIterator
Return Value
WireSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace